vlm/extension/Enums/СтатусыСпецификаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыСпецификаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Закрыта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВРазработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Catalogs/ТехнологическиеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТехнологическиеОперации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Загрузка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Непрерывная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПропустить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПередаточнаяПартия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТехнологическийПроцесс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеПроцессы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяПЗЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контроль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляТехнологическихОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВариантНаладки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыНаладки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВремяШтучноеЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МожноПовторить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоэффициентТехнологическогоПроцесса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВспомогательныеРабочиеЦентры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

vlm/extension/CommonModules/бит_ОбщегоНазначенияСервер/Ext/Module.bsl
// Изменение значения реквизита объекта.
//
// Параметры:
//   СсылкаНаОбъект - Ссылка на изменяемый объект
//   СтруктураРеквизитов - Структура, в которой ключ - имя реквизита, а значение - значение реквизита. Проверка на наличие реквизита объекта не предусмотрена
//   СтруктураДопПараметры - Структура доп.параметров, присваиваемых объекту при записи  
//
Процедура ОбновитьРеквизитОбъекта(СсылкаНаОбъект, СтруктураРеквизитов, СтруктураДопПараметры = Неопределено) Экспорт

	Объект = СсылкаНаОбъект.ПолучитьОбъект();
	Для каждого стр из СтруктураРеквизитов Цикл
		Объект[стр.Ключ] = стр.Значение;
	КонецЦикла;
	Если СтруктураДопПараметры <> Неопределено Тогда
		Для каждого стр из СтруктураДопПараметры Цикл
			Если Объект.ДополнительныеСвойства.Свойство(стр.Ключ) = Ложь Тогда
				Объект.ДополнительныеСвойства.Вставить(стр.Ключ, стр.Значение);
			Иначе                              
				Объект.ДополнительныеСвойства[стр.Ключ] = стр.Значение;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Объект.Записать();

КонецПроцедуры

Функция СпецификацияНоменклатуры(Номенклатура, Дата = Неопределено) Экспорт
	
	Спецификация = Справочники.РесурсныеСпецификации.ПустаяСсылка();

	Если ЗначениеЗаполнено(Номенклатура) Тогда
			
		Запрос = Новый Запрос("ВЫБРАТЬ
			|	РесурсныеСпецификации.НачалоДействия КАК НачалоДействия,
			|	РесурсныеСпецификации.Ссылка КАК Спецификация
			|ИЗ
			|	Справочник.РесурсныеСпецификации КАК РесурсныеСпецификации
			|ГДЕ
			|	РесурсныеСпецификации.ОсновноеИзделиеНоменклатура = &Номенклатура
			|	И РесурсныеСпецификации.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыСпецификаций.Действует)
			|	И ВЫБОР
			|			КОГДА РесурсныеСпецификации.КонецДействия = ДАТАВРЕМЯ(1, 1, 1)
			|				ТОГДА ИСТИНА
			|			КОГДА РесурсныеСпецификации.КонецДействия >= &Дата
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|	И РесурсныеСпецификации.НачалоДействия <= &Дата
			|
			|УПОРЯДОЧИТЬ ПО
			|	НачалоДействия УБЫВ
			|");
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, Дата("00010101"), Дата));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Спецификация = Выборка.Спецификация;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Спецификация;
	
КонецФункции

Процедура ПолучитьПоследниеЭтапОперацияПоСпецификации(РесурснаяСпецификация, ПоследнийЭтап = Неопределено, ПоследняяОперация = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
		|	ЭтапыПроизводства.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Этап
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ЭтапыПроизводства.НомерЭтапа) КАК НомерЭтапа,
		|		ЭтапыПроизводства.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|	ГДЕ
		|		ЭтапыПроизводства.Владелец = &РесурснаяСпецификация
		|		И НЕ ЭтапыПроизводства.ПометкаУдаления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ЭтапыПроизводства.Владелец) КАК влМаксЭтап
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭтапыПроизводства КАК ЭтапыПроизводства
		|		ПО (влМаксЭтап.НомерЭтапа = ЭтапыПроизводства.НомерЭтапа)
		|			И (влМаксЭтап.Владелец = ЭтапыПроизводства.Владелец)
		|			И (НЕ ЭтапыПроизводства.ПометкаУдаления)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТехнологическиеОперации.Ссылка КАК Операция,
		|	ТехнологическиеОперации.Владелец КАК Этап 
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ТехнологическиеОперации.НомерОперации) КАК НомерОперации,
		|		ТехнологическиеОперации.Владелец КАК Владелец
		|	ИЗ
		|		Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|	ГДЕ
		|		ТехнологическиеОперации.Владелец В
		|				(ВЫБРАТЬ
		|					Этап.Ссылка
		|				ИЗ
		|					Этап КАК Этап)
		|		И НЕ ТехнологическиеОперации.ПометкаУдаления
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ТехнологическиеОперации.Владелец) КАК влОперация
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТехнологическиеОперации КАК ТехнологическиеОперации
		|		ПО (ТехнологическиеОперации.Владелец = влОперация.Владелец)
		|			И (влОперация.НомерОперации = ТехнологическиеОперации.НомерОперации)
		|			И (НЕ ТехнологическиеОперации.ПометкаУдаления)
		|"); 
	Запрос.УстановитьПараметр("РесурснаяСпецификация", РесурснаяСпецификация);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ПоследнийЭтап 		= Результат.Этап;
		ПоследняяОперация	= Результат.Операция;
	КонецЕсли;

КонецПроцедуры

Процедура ПолучитьТаблицуЗначенийИзФайла(АдресФайла, ИмяФайла, АдресТЗ, НомерКолонкиСДанными = 1, НомерСтрокиСДанными = 1, АдресТЗОписанияТиповКолонок = "") Экспорт 
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	
	Расширение = Прав(ИмяФайла, 4);
	Расширение = СтрЗаменить(Расширение, ".", "");
	
	ФайлПриемник = ПолучитьИмяВременногоФайла(Расширение);
	ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресФайла);
	ДанныеХранилища.Записать(ФайлПриемник);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Очистить();
	ТабличныйДокумент.Прочитать(ФайлПриемник);
	
	НомерКолонки = 0;
	
	Если ЗначениеЗаполнено(АдресТЗОписанияТиповКолонок) Тогда
		
		ТаблицаОписаниеТиповКолонок = ПолучитьИзВременногоХранилища(АдресТЗОписанияТиповКолонок);
		
	Иначе
		
		ТаблицаОписаниеТиповКолонок = Неопределено;
		
	КонецЕсли;
	
	Пока Истина Цикл
		
		НомерКолонки = НомерКолонки + 1;
		ИмяКолонки = "_" + ?(НомерКолонки<10,"0","") + Формат(НомерКолонки,"ЧГ=0");                    
		
		Если ПустаяСтрока(ТабличныйДокумент.Область(1, НомерКолонки).Текст) Тогда
			Прервать;
		КонецЕсли;
		
		СтруктураОтбора = Новый Структура("НомерКолонки", НомерКолонки);	
		
		ОписаниеТипаКолонки = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255));	
			
		Если ТаблицаОписаниеТиповКолонок <> Неопределено Тогда
			
			НайденныеСтроки = ТаблицаОписаниеТиповКолонок.НайтиСтроки(СтруктураОтбора);
			
			Если НайденныеСтроки.Количество() <> 0 Тогда
				ОписаниеТипаКолонки = НайденныеСтроки[0].ОписаниеТипа;	
			КонецЕсли;
			
		КонецЕсли;
		
		ТаблицаЗначений.Колонки.Добавить(ИмяКолонки, ОписаниеТипаКолонки);
		
	КонецЦикла;
	
	НомерСтроки = НомерСтрокиСДанными;
	
	СчетчикКолонок = НомерКолонки - 1;
	 
	ФлагПрерывания = Ложь;
	
	Пока Истина Цикл
		
		Стр = ТаблицаЗначений.Добавить();
		
		Для А = 1 ПО СчетчикКолонок Цикл
			
			ТекстКолонки = ТабличныйДокумент.Область(НомерСтроки, А).Текст;
			
			Если ПустаяСтрока(ТекстКолонки) Тогда
				
				Если А = НомерКолонкиСДанными Тогда
					ФлагПрерывания = Истина;
					ТаблицаЗначений.Удалить(Стр);
				КонецЕсли;
				
			Иначе

				Стр["_" + ?(А<10,"0","")+ Формат(А,"ЧГ=0")] = СтрЗаменить(ТекстКолонки, Символ(160), "");
				
			КонецЕсли;
			              
			Если ФлагПрерывания Тогда
				Прервать
			КонецЕсли;
			
		КонецЦикла;
		
		Если ФлагПрерывания Тогда
			Прервать
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	АдресТЗ = ПоместитьВоВременноеХранилище(ТаблицаЗначений);
		
КонецПроцедуры

Функция СериализоватьДанныеВJSON(Знач Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(Новый ПараметрыЗаписиJSON(, Символы.Таб));
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть(); 

КонецФункции
	
Функция СериализоватьДанныеИзJSON(СтрокаJSON) Экспорт
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции  

Функция ОкруглитьВверх(Знач ИсхЧисло, Знач Точность = 0) Экспорт
	// Если округление до целых
	Если Точность = 0 Тогда
		Если ИсхЧисло = Цел(ИсхЧисло) Тогда
			// целое число — не поднимаем
			Результат = ИсхЧисло;
		Иначе
			// не целое — поднимаем до следующего целого
			Результат = Цел(ИсхЧисло) + 1;
		КонецЕсли;
	Иначе
		
		// Если есть точность (например 0.1, 0.01 и т.п.)
		
		// Вычисляем шаг округления
		Шаг = Точность;
		
		// Находим «верхнюю границу»
		Остаток = ИсхЧисло % Шаг;
		
		Если Остаток = 0 Тогда
			// уже кратно шагу — не округляем вверх
			Результат =  ИсхЧисло;
		Иначе
			Результат =  ИсхЧисло - Остаток + Шаг;
		КонецЕсли; 
	КонецЕсли;       
	
	Возврат Результат;
	
КонецФункции
